location_1 = ['光谷', '东湖', '中国（湖北）自由贸易试验区武汉片区，国家光电子信息产业基地', '国家生物产业基地']
location_2 = ['关东', '佛祖岭', '豹澥', '九峰', '花山', '左岭', '龙泉', '滨湖', '智苑', '生物城', '未来', '东湖综合保税区', '光谷光电子信息产业园', '光谷现代服务业产业园', '光谷智能制造产业园', '光谷中华科技产业园', '中心城']
people = ['刘洁', '张勇强', '宋治平', '夏亚民', '关维强', '冯立', '胡捷', '李首文', '沈阳东', '明铭', '李世庭', '曾祥华', '黄峰']
company = ['激光', '百度', '集度', '长江存储', '光电', '当代集团', '中冶南方', '葛化', '祥龙', '盛隆', '长飞', '烽火', '邮科', '人工智能', '智能网联', '富士康', '高科', '高农', '华星', '华康', '木仓', '光庭', '小米武汉', '华工科技', '新芯', '葛化', '武汉高科国有控股集团', '湖北省科技投资集团', '武汉光谷建设投资', '武汉金山', '金山+光谷', '金山+东湖', '武汉富士康', '酩扬沐影', '奥山', '斑马快跑', '链尚逸家', '加盐在线教育', '秘境实景娱乐', '薇拉科技', '武汉爱迪天才', '纳海杰青公司', '天马', '迈瑞', '基因', '省科投', '3551']
key_words = [location_1, location_2, people, company]

def find_key_words(content):
    for i in key_words:
        for j in i:
            if j in content:
                return True